Repository: arkadeleon/ragnarok-offline
Catalog: Packages/RagnarokConstants/Sources/RagnarokConstants/Resources/JobID.xcstrings
Source language: en
Languages: ja, ko, pt_br, ru, zh_hans, zh_hant

source: Acolyte
ja: アコライト
ko: 어콜라이트
pt_br: Noviço
ru: Послушник
zh_hans: 服事
zh_hant: 服事

source: Alchemist
ja: アルケミスト
ko: 알케미스트
pt_br: Alquimista
ru: Алхимик
zh_hans: 炼金术士
zh_hant: 鍊金術師

source: Archbishop
ja: アークビショップ
ko: 아크 비숍
pt_br: Arcebispo
ru: Архиепископ
zh_hans: 大主教
zh_hant: 大主教

source: Archer
ja: アーチャー
ko: 아처
pt_br: Arqueiro
ru: Лучник
zh_hans: 弓箭手
zh_hant: 弓箭手

source: Assassin
ja: アサシン
ko: 어새신
pt_br: Mercenário
ru: Убийца
zh_hans: 刺客
zh_hant: 刺客

source: Assassin Cross
ja: アサシンクロス
ko: 어새신크로스
pt_br: Algoz
ru: Ассасин
zh_hans: 十字刺客
zh_hant: 十字刺客

source: Bard
ja: バード
ko: 바드
pt_br: Bardo
ru: Бард
zh_hans: 诗人
zh_hant: 吟遊詩人

source: BlackSmith
ja: ブラックスミス
ko: 블랙스미스
pt_br: Ferreiro
ru: Кузнец
zh_hans: 铁匠
zh_hant: 鐵匠

source: Champion
ja: チャンピオン
ko: 챔피온
pt_br: Mestre
ru: Мистик
zh_hans: 武术宗师
zh_hant: 武術宗師

source: Clown
ja: クラウン
ko: 클로운
pt_br: Menestrel
ru: Менестрель
zh_hans: 搞笑诗人
zh_hant: 搞笑藝人

source: Creator
ja: クリエイター
ko: 크리에이터
pt_br: Criador
ru: Биохимик
zh_hans: 创造者
zh_hant: 創造者

source: Crusader
ja: クルセイダー
ko: 크루세이더
pt_br: Templário
ru: Крестоносец
zh_hans: 十字军
zh_hant: 十字軍

source: Dancer
ja: ダンサー
ko: 댄서
pt_br: Odalisca
ru: Танцовщица
zh_hans: 舞娘
zh_hant: 舞孃

source: Genetic
ja: ジェネティック
ko: 제네릭
pt_br: Bioquímico
ru: Генетик
zh_hans: 基因学者
zh_hant: 基因學者

source: Guillotine Cross
ja: ギロチンクロス
ko: 길로틴 크로스
pt_br: Sicário
ru: Каратель
zh_hans: 十字切割者
zh_hant: 十字斬首者

source: Gunslinger
ja: ガンスリンガー
ko: 건슬링거
pt_br: Justiceiro
ru: Стрелок
zh_hans: 神枪手
zh_hant: 神槍手

source: Gypsy
ja: ジプシー
ko: 집시
pt_br: Cigana
ru: Цыганка
zh_hans: 冷艳舞姬
zh_hant: 冷豔舞姬

source: High Acolyte
ja: 転生アコライト
ko: 어콜라이트 하이
pt_br: Noviço T
ru: Старший Послушник
zh_hans: 进阶服事
zh_hant: 進階服事

source: High Archer
ja: 転生アーチャー
ko: 아처 하이
pt_br: Arqueiro T
ru: Старший Лучник
zh_hans: 进阶弓箭手
zh_hant: 進階弓箭手

source: High Mage
ja: 転生マジシャン
ko: 매지션 하이
pt_br: Mago T
ru: Старший Маг
zh_hans: 进阶魔法师
zh_hant: 進階魔法師

source: High Merchant
ja: 転生マーチャント
ko: 머첸트 하이
pt_br: Mercador T
ru: Старший Торговец
zh_hans: 进阶商人
zh_hant: 進階商人

source: High Novice
ja: 転生ノービス
ko: 하이노비스
pt_br: Aprendiz T
ru: Старший Новичок
zh_hans: 进阶初心者
zh_hant: 進階初學者

source: High Priest
ja: ハイプリースト
ko: 하이프리스트
pt_br: Sumo Sacerdote
ru: Епископ
zh_hans: 神官
zh_hant: 神官

source: High Swordman
ja: 転生ソードマン
ko: 소드맨 하이
pt_br: Espadachim T
ru: Старший Мечник
zh_hans: 进阶剑士
zh_hant: 進階劍士

source: High Thief
ja: 転生シーフ
ko: 씨프 하이
pt_br: Gatuno T
ru: Старший Вор
zh_hans: 进阶盗贼
zh_hant: 進階盜賊

source: High Wizard
ja: ハイウィザード
ko: 하이위저드
pt_br: Arquimago
ru: Архимаг
zh_hans: 超魔导士
zh_hant: 超魔導師

source: Hunter
ja: ハンター
ko: 헌터
pt_br: Caçador
ru: Охотник
zh_hans: 猎人
zh_hant: 獵人

source: Knight
ja: ナイト
ko: 나이트
pt_br: Cavaleiro
ru: Рыцарь
zh_hans: 骑士
zh_hant: 騎士

source: Lord Knight
ja: ロードナイト
ko: 로드나이트
pt_br: Lorde
ru: Командор
zh_hans: 骑士领主
zh_hant: 騎士領主

source: Mage
ja: マジシャン
ko: 매지션
pt_br: Mago
ru: Маг
zh_hans: 魔法师
zh_hant: 魔法師

source: Mechanic
ja: メカニック
ko: 미케닉
pt_br: Mecânico
ru: Механик
zh_hans: 机匠
zh_hant: 機械工匠

source: Merchant
ja: マーチャント
ko: 머첸트
pt_br: Mercador
ru: Торговец
zh_hans: 商人
zh_hant: 商人

source: Minstrel
ja: ミンストレル
ko: 민스트럴
pt_br: Trovador
ru: Маэстро
zh_hans: 宫廷乐师
zh_hant: 宮廷樂師

source: Monk
ja: モンク
ko: 몽크
pt_br: Monge
ru: Монах
zh_hans: 武僧
zh_hant: 武道家

source: Ninja
ja: 忍者
ko: 닌자
ru: Ниндзя
zh_hans: 忍者
zh_hant: 忍者

source: Novice
ja: ノービス
ko: 노비스
pt_br: Aprendiz
ru: Новичок
zh_hans: 初心者
zh_hant: 初學者

source: Paladin
ja: パラディン
ko: 팔라딘
pt_br: Paladino
ru: Паладин
zh_hans: 圣殿十字军
zh_hant: 聖殿十字軍

source: Priest
ja: プリースト
ko: 프리스트
pt_br: Sacerdote
ru: Священник
zh_hans: 牧师
zh_hant: 祭司

source: Professor
ja: プロフェッサー
ko: 프로페서
ru: Профессор
zh_hans: 智者
zh_hant: 智者

source: Ranger
ja: レンジャー
ko: 레인져
pt_br: Rastreador
ru: Рэйнджер
zh_hans: 游侠
zh_hant: 遊俠

source: Rogue
ja: ローグ
ko: 로그
pt_br: Arruaceiro
ru: Разбойник
zh_hans: 流氓
zh_hant: 流氓

source: Royal Guard
ja: ロイヤルガード
ko: 로얄가드
pt_br: Guardião Real
ru: Тамплиер
zh_hans: 皇家卫士
zh_hant: 皇家禁衛隊

source: Rune Knight
ja: ルーンナイト
ko: 룬 나이트
pt_br: Cavaleiro Rúnico
ru: Рунмейстер
zh_hans: 符文骑士
zh_hant: 盧恩騎士

source: Sage
ja: セージ
ko: 세이지
pt_br: Sábio
ru: Мудрец
zh_hans: 贤者
zh_hant: 賢者

source: Shadow Chaser
ja: シャドウチェイサー
ko: 쉐도우 체이서
pt_br: Renegado
ru: Преследователь
zh_hans: 逐影
zh_hant: 魅影追蹤者

source: Sniper
ja: スナイパー
ko: 스나이퍼
pt_br: Atirador de Elite
ru: Снайпер
zh_hans: 神射手
zh_hant: 神射手

source: Sorcerer
ja: ソーサラー
ko: 소서러
pt_br: Feiticeiro
ru: Элементалист
zh_hans: 元素使
zh_hant: 妖術師

source: Soul Linker
ja: ソウルリンカー
ko: 소울링커
pt_br: Espiritualista
ru: Медиум
zh_hans: 悟灵士
zh_hant: 悟靈士

source: Stalker
ja: チェイサー
ko: 스토커
pt_br: Desordeiro
ru: Сталкер
zh_hans: 神行太保
zh_hant: 神行太保

source: Super Novice
ja: スーパーノービス
ko: 슈퍼노비스
pt_br: Superaprendiz
ru: Суперновичок
zh_hans: 超级初心者
zh_hant: 超級初學者

source: Sura
ja: 修羅
ko: 수라
pt_br: Shura
ru: Отшельник
zh_hans: 修罗
zh_hant: 修羅

source: Swordman
ja: ソードマン
ko: 소드맨
pt_br: Espadachim
ru: Мечник
zh_hans: 剑士
zh_hant: 劍士

source: Taekwon Boy/Girl
ja: テコンキッド
ko: 태권소년/소녀
pt_br: Taekwon
ru: Таэквондист
zh_hans: 跆拳少年少女
zh_hant: 跆拳少年少女

source: Taekwon Master
ja: 拳聖
ko: 권성
pt_br: Mestre Taekwon
ru: Гладиатор
zh_hans: 拳圣
zh_hant: 拳聖

source: Thief
ja: シーフ
ko: 씨프
pt_br: Gatuno
ru: Вор
zh_hans: 盗贼
zh_hant: 盜賊

source: Wanderer
ja: ワンダラー
ko: 원더러
pt_br: Musa
ru: Муза
zh_hans: 漫游舞者
zh_hant: 浪姬舞者

source: Warlock
ja: ウォーロック
ko: 워록
pt_br: Arcano
ru: Чародей
zh_hans: 大法师
zh_hant: 咒術士

source: WhiteSmith
ja: ホワイトスミス
ko: 화이트스미스
pt_br: Mestre Ferreiro
ru: Оружейник
zh_hans: 神工匠
zh_hant: 神工匠

source: Wizard
ja: ウィザード
ko: 위저드
pt_br: Bruxo
ru: Волшебник
zh_hans: 巫师
zh_hant: 巫師
